import * as Yup from 'yup';

export const OrderSchema = Yup.object({
  fullname: Yup.string()
    .min(3, "Повне ім'я має бути більше 3-х букв ")
    .max(40, "Повне ім'я не може бути більше за 40 букв")
    .matches(/^[A-Za-zА-Яа-яІіЇї\s.]{3,40}$/, "Повне ім'я має містити тільки букви, пробіли і точки від 3 до 40 букв.")
    .required("Введіть П.І.Б."),
  email: Yup.string()
    .min(10, "Імейл має бути більше 10-ти символів ")
    .max(40, "Імейл не може бути більше за 40 символів")
    .matches(/^(https?:\/\/)?[a-zA-Z0-9-._]+@[a-zA-Z]+\.[a-z]{2,7}$/, "Імейл має виглядати так (http)/https://example.com або example.com")
    .required("Введіть імейл."),
  quantity: Yup.string()
    .min(1,"Замовити можна мінімум 1 товар")
    .max(10, "Замовити можна максимум 10 товарів")
    .matches(/^([1-9]|10)$/,"Введіть цифру від 1 до 10")
    .required("Виберіть кількість товарів.")
  ,
  phone: Yup.string()
    .min(10,"Телефон має бути не менше 10 цифр.")
    .max(20,"Телефон має бути менше або 20 цифр.")
    .matches(/^\+?\d{10,20}$/, "Телефон має бути у форматі +380ХХХХХХХХХ або 050ХХХХХХХ")
    .required("Введіть номер телефону клієнта.")
  ,
  titleOrder: Yup.string()
    .min(2, "Назва товару має бути не менше 2 букв.")
    .max(50,"Назва товару має бути не більше 50 букв.")
    .required("Введіть назву товару.")
  ,
  price: Yup.string()
    .min(1,"Ціна має містити не менше одної цифри.")
    .required("Введіть ціну.")
  ,
  postOffice: Yup.string()
    .min(1, "Адреса відділення пошти має містити не менше 1 літери.")
    .max(40,"Адреса відділення пошти має містити не більше 40 літер.")
    .matches(/^[a-zA-Zа-яА-ЯЇїЄєІіҐґ0-9\s№-]{1,40}$/, "Адреса відділення може містити літери, цифри, пробіли, № та дефіси")

  ,
  city: Yup.string()
    .min(3,"Назва міста,села, населенного пункту має бути не менше 3 літер.")
    .max(100,"Назва міста, села, населенного пункту має бути не більше 100 літер. ")
    .matches(/^[a-zA-Zа-яА-ЯЇїЄєІіҐґ\s]{3,100}$/, 'Назва міста, села, населенного пункту має містити тільки літери і пробіли.')
    .required("Введіть назву міста.")
  ,
  comment: Yup.string()
    .matches(/^[a-zA-Zа-яА-Я0-9 .,]{2,300}$/, "Коментар може містити тільки літери, цифри , крапки та коми (не більше 300 символів)")
});